princeton/ipvs/results/timeseries/time-varying/1_X_max/oracle-three-backends/500ms-fluctuation/5mins-run/wlc/run/httperf_client_126.log
httperf --verbose --hog --timeout=50 --client=0/1 --server=172.16.116.116 --port=8080 --uri=/ --rate=8 --send-buffer=4096 --recv-buffer=16384 --num-conns=2400 --num-calls=1
httperf: maximum number of open descriptors = 65535
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
            10.5 181
            11.5 629
            12.5 415
            13.5 219
            14.5 129
            15.5 234
            16.5 263
            17.5 157
            18.5 79
            19.5 38
            20.5 21
            21.5 18
            22.5 9
            23.5 4
            24.5 3
             :
            29.5 1

Total: connections 2400 requests 2400 replies 2400 test-duration 299.887 s

Connection rate: 8.0 conn/s (125.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 10.2 avg 13.9 max 29.0 median 12.5 stddev 2.7
Connection time [ms]: connect 0.7
Connection length [replies/conn]: 1.000

Request rate: 8.0 req/s (125.0 ms/req)
Request size [B]: 67.0

Reply rate [replies/s]: min 8.0 avg 8.0 max 8.0 stddev 0.0 (299 samples)
Percentages of the replies served at a given rate:
   50%: 7
   66%: 7
   75%: 7
   80%: 7
   90%: 7
   95%: 7
   98%: 7
   99%: 7
  100%: 8

Reply time [ms]: response 12.7 transfer 0.4
Percentages of the requests served within a certain time (ms) :
   50%: 11
   66%: 13
   75%: 14
   80%: 15
   90%: 16
   95%: 17
   98%: 18
   99%: 19
  100%: 27

Reply size [B]: header 163.0 content 72.0 footer 2.0 (total 237.0)
Reply status: 1xx=0 2xx=2400 3xx=0 4xx=0 5xx=0

CPU time [s]: user 252.89 system 46.61 (user 84.3% system 15.5% total 99.9%)
Net I/O: 2.4 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0